validation/oneWayCoupledVdfTransportFoam/spray1D/monoModal_nonLinear/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    top
    {
        type    zeroGradient;
    }
    inlet
    {
        type    zeroGradient;
    }
    outlet
    {
        type    fixedValue;
        value   $internalField;
    }
    defaultFaces
    {
        type    empty;
    }
    wedge1
    {
        type    wedge;
    }
    wedge2
    {
        type    wedge;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
