validation/oneWayCoupledVdfTransportFoam/spray1D/monoModal_nonLinear/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication generateMoments
runApplication oneWayCoupledVdfTransportFoam
runApplication postProcess -func sampleDict -latestTime
( cd validation && ./createGraphs )

# ----------------------------------------------------------------- end-of-file
